import Vue from "vue"

const rules = {
  required: (v) => !!v || v === 0 || "กรุณากรอกข้อมูล",
  selected: (v) => v.length != 0 || "กรุณาเลือกข้อมูล",
  numeric: (v) => !isNaN(v) || "กรุณากรอกข้อมูลเฉพาะตัวเลขเท่านั้น",
  isInteger: (v) => !v || v % 1 === 0 || "โปรดระบุจำนวนเต็มเท่านั้น",
  isPositive: (v) => !v || v > 0 || "ต้องระบุค่ามากกว่า 0 เท่านั้น",
  emailRules: [
    (v) => !v || /^\w+([.-]?\w+)*@\w+([.-]?\w+)*(\.\w{2,3})+$/.test(v) || "อีเมลไม่ถูกต้อง",
  ],
  passwordRules: [
    (v) => !v || v.length >= 5 || "รหัสผ่านผู้ใช้งานต้องมีอย่างน้อย 5 ตัว",
    (v) => !v || /(?=.*[A-Z])/.test(v) || "รหัสผ่านผู้ใช้งานต้องประกอบไปด้วย ตัวอักษรตัวใหญ่ 1 ตัว",
    (v) => !v || /(?=.*\d)/.test(v) || "รหัสผ่านผู้ใช้งานต้องประกอบไปด้วย ตัวเลข 1 ตัว",
    (v) =>
      !v || /([!@$%])/.test(v) || "รหัสผ่านผู้ใช้งานต้องประกอบไปด้วย อักขระพิเศษ 1 ตัว [!@#$%]",
  ],
  phoneRules: [
    (v) => !v || (v.length >= 9 && v.length <= 10) || "เบอร์มือถือต้องมีระหว่าง 9-10 ตัว",
  ],
  roleRules: [
    (v) =>
      !v ||
      !!["admin", "user"].includes(v) ||
      "เลือกสิทธิ์การใช้งานผู้ใช้งานได้เฉพาะ Admin หรือ User เท่านั้น",
  ],
  photoURLRules: [(v) => !v || v.size < 5242880 || "ขนาดไฟล์ไม่ควรเกิน 5 MB!"],
  priceRules: [(v) => !v || v >= 0 || "โปรดระบุจำนวนเงินให้มากกว่าหรือเท่ากับ 0 บาท"],
  stockRules: [(v) => !v || v >= 0 || "โปรดระบุจำนวนให้มากกว่าหรือเท่ากับ 0"],
  amountRules(max = 0) {
    return [(v) => !v || (v > 0 && v <= max) || `โปรดระบุจำนวนให้มากกว่า 0 ถึง ${max}`]
  },
}

Vue.prototype.$rules = rules

export default ({}, inject) => {
  inject("rules", rules)
}
